Revit 2023 API
BuiltInFailures.SlabShapeFailures.SlabShapeFailedTooThin Property
 The Floor or Roof is too thin for its given type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static FailureDefinitionId SlabShapeFailedTooThin { get; }
Visual Basic
Public Shared ReadOnly Property SlabShapeFailedTooThin As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SlabShapeFailedTooThin {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace